SoCXin/HC32F460/src/template_Rev1.0.5/hc32f460pehb_template/example/EWARM/hc32f460pehb.svd
                <register>
                    <name>RECNT</name>
                    <description>desc RECNT</description>
                    <addressOffset>0xB2</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>TECNT</name>
                    <description>desc TECNT</description>
                    <addressOffset>0xB3</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>ACFCTRL</name>
                    <description>desc ACFCTRL</description>
                    <addressOffset>0xB4</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x2F</resetMask>
                    <fields>
                        <field>
                            <name>ACFADR</name>
                            <description>desc ACFADR</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SELMASK</name>
                            <description>desc SELMASK</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ACFEN</name>
                    <description>desc ACFEN</description>
                    <addressOffset>0xB6</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x1</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>AE_1</name>
                            <description>desc AE_1</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AE_2</name>
                            <description>desc AE_2</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AE_3</name>
                            <description>desc AE_3</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AE_4</name>
                            <description>desc AE_4</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AE_5</name>
                            <description>desc AE_5</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AE_6</name>
                            <description>desc AE_6</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AE_7</name>
                            <description>desc AE_7</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AE_8</name>
                            <description>desc AE_8</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ACF</name>
                    <description>desc ACF</description>
                    <addressOffset>0xB8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7FFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>ACODEORAMASK</name>
                            <description>desc ACODEORAMASK</description>
                            <msb>28</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AIDE</name>
                            <description>desc AIDE</description>
                            <msb>29</msb>
                            <lsb>29</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AIDEE</name>
                            <description>desc AIDEE</description>
                            <msb>30</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TBSLOT</name>
                    <description>desc TBSLOT</description>
                    <addressOffset>0xBE</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>TBPTR</name>
                            <description>desc TBPTR</description>
                            <msb>5</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TBF</name>
                            <description>desc TBF</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TBE</name>
                            <description>desc TBE</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TTCFG</name>
                    <description>desc TTCFG</description>
                    <addressOffset>0xBF</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x90</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>TTEN</name>
                            <description>desc TTEN</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>T_PRESC</name>
                            <description>desc T_PRESC</description>
                            <msb>2</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TTIF</name>
                            <description>desc TTIF</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TTIE</name>
                            <description>desc TTIE</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TEIF</name>
                            <description>desc TEIF</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WTIF</name>
                            <description>desc WTIF</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WTIE</name>
                            <description>desc WTIE</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>REF_MSG</name>
                    <description>desc REF_MSG</description>
                    <addressOffset>0xC0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x9FFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>REF_ID</name>
                            <description>desc REF_ID</description>
                            <msb>28</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>REF_IDE</name>
                            <description>desc REF_IDE</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TRG_CFG</name>
                    <description>desc TRG_CFG</description>
                    <addressOffset>0xC4</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xF73F</resetMask>
                    <fields>
                        <field>
                            <name>TTPTR</name>
                            <description>desc TTPTR</description>
                            <msb>5</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TTYPE</name>
                            <description>desc TTYPE</description>
                            <msb>10</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TEW</name>
                            <description>desc TEW</description>
                            <msb>15</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TT_TRIG</name>
                    <description>desc TT_TRIG</description>
                    <addressOffset>0xC6</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>TT_WTRIG</name>
                    <description>desc TT_WTRIG</description>
                    <addressOffset>0xC8</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0xFFFF</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
